<?php

return [

    'accepted' => 'يجب قبول هذا الحقل.',
    'active_url' => 'الرابط غير صالح.',
    'after' => 'يجب أن يكون التاريخ بعد :date.',
    'alpha' => 'يجب أن يحتوي الحقل على أحرف فقط.',
    'alpha_num' => 'يجب أن يحتوي الحقل على أحرف وأرقام فقط.',
    'array' => 'يجب أن يكون الحقل مصفوفة.',
    'before' => 'يجب أن يكون التاريخ قبل :date.',
    'between' => [
        'numeric' => 'يجب أن تكون القيمة بين :min و :max.',
        'file' => 'يجب أن يكون حجم الملف بين :min و :max كيلوبايت.',
        'string' => 'يجب أن يحتوي النص على ما بين :min و :max حرفًا.',
        'array' => 'يجب أن تحتوي المصفوفة على ما بين :min و :max عنصرًا.',
    ],
    'boolean' => 'يجب أن يكون الحقل صحيحًا أو خطأ.',
    'confirmed' => 'تأكيد الحقل غير مطابق.',
    'email' => 'يجب أن يكون بريدًا إلكترونيًا صالحًا.',
    'required' => 'هذا الحقل مطلوب.',
    'string' => 'يجب أن يكون نصًا.',
    'unique' => 'هذه القيمة مستخدمة من قبل.',
    'min' => [
        'string' => 'يجب ألا يقل عن :min حروف.',
    ],
    'max' => [
        'string' => 'يجب ألا يزيد عن :max حروف.',
    ],

    'attributes' => [
        'email' => 'البريد الإلكتروني',
        'password' => 'كلمة المرور',
        'name' => 'الاسم',
    ],
    'exists' => 'القيمة المحددة  غير موجودة.',

];
